# Git integration and aliases
ohmyzsh/ohmyzsh path:plugins/git

# Auto-fetch git updates
ohmyzsh/ohmyzsh path:plugins/git-auto-fetch

# Terraform CLI support
ohmyzsh/ohmyzsh path:plugins/terraform

# Command suggestions
zsh-users/zsh-autosuggestions

# Syntax highlighting
zsh-users/zsh-syntax-highlighting

# Extra completions
zsh-users/zsh-completions

# Fuzzy tab completion
Aloxaf/fzf-tab

# Smart cd navigation
ajeetdsouza/zoxide

# Tmux integration
ohmyzsh/ohmyzsh path:plugins/tmux

# History search with arrows
zsh-users/zsh-history-substring-search
